In [3]:
# import libraries
import numpy as np
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

In [6]:
# Database credentials:
host = "mid-term-project.ca2jkepgjpne.us-east-2.rds.amazonaws.com"
port = "5432"
user = "lhl_student"
pwd = "lhl_student"
database = "mid_term_project"

In [7]:
# Create a connection to the database
postgres_credentials = ('postgresql://{username}:{password}@{ipaddress}:{port}/{dbname}'.format(
    username = user,
    password = pwd,
    ipaddress = host,
    port = port,
    dbname = database))
connection = create_engine(postgres_credentials)

In [23]:
# load flights data:
query = '''
SELECT * FROM flights 
ORDER BY RANDOM() 
LIMIT 200000
'''
flights_data = pd.read_sql(sql=query, con=connection)
#flights_data = pd.read_sql_query(query, connection)

In [25]:
# save flights data as csv file
flights_data.to_csv("Data/flights_data.csv", index=False)

In [26]:
flights_data.head(2)

,fl_date,mkt_unique_carrier,branded_code_share,mkt_carrier,mkt_carrier_fl_num,op_unique_carrier,tail_num,op_carrier_fl_num,origin_airport_id,origin,...,distance,carrier_delay,weather_delay,nas_delay,security_delay,late_aircraft_delay,first_dep_time,total_add_gtime,longest_add_gtime,no_name
0,2018-10-26,WN,WN,WN,1849,WN,N7828A,1849,13232,MDW,...,251.0,NaN,NaN,NaN,NaN,NaN,None,NaN,NaN,None
1,2018-07-16,UA,UA,UA,673,UA,N14219,673,11042,CLE,...,288.0,NaN,NaN,NaN,NaN,NaN,None,NaN,NaN,None

In [27]:
flights_data.shape

(200000, 42)

In [29]:
# load passengers data:
query = '''
SELECT * FROM passengers 
ORDER BY RANDOM() 
LIMIT 200000
'''
passengers_data = pd.read_sql(sql=query ,con=connection)

In [31]:
# save passengers data as csv file
passengers_data.to_csv("Data/passengers_data.csv", index=False)

In [32]:
passengers_data.shape

(200000, 38)

In [33]:
passengers_data.head(2)

,departures_scheduled,departures_performed,payload,seats,passengers,freight,mail,distance,ramp_to_ramp,air_time,...,dest_country,dest_country_name,aircraft_group,aircraft_type,aircraft_config,year,month,distance_group,class,data_source
0,0.0,1.0,1100.0,6.0,0.0,0.0,0.0,81.0,40.0,36.0,...,US,United States,0,35,3,2019,3,1,L,DU
1,31.0,30.0,456000.0,2280.0,1263.0,0.0,0.0,1648.0,7800.0,6984.0,...,MX,Mexico,6,673,1,2019,3,4,F,IU

In [34]:
# load fuel_comsumptio data:
query = "SELECT * FROM fuel_comsumption"
fuel_data = pd.read_sql(sql=query ,con=connection)

In [35]:
fuel_data.shape

(3035, 25)

In [36]:
fuel_data.head(2)

,month,airline_id,unique_carrier,carrier,carrier_name,carrier_group_new,sdomt_gallons,satl_gallons,spac_gallons,slat_gallons,...,sdomt_cost,satl_cost,spac_cost,slat_cost,sint_cost,ts_cost,tdomt_cost,tint_cost,total_cost,year
0,1,NaN,None,0JQ,None,1,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,5100.0,0.0,5100.0,2016
1,1,21352.0,0WQ,0WQ,Avjet Corporation,1,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,396216.0,140239.0,536455.0,2016

In [37]:
# save fuel comsumptio data as csv file
fuel_data.to_csv("Data/fuel_data.csv", index=False)

In [120]:
flights = pd.read_csv("data/flights_data.csv")

In [121]:
flights.head()

,fl_date,mkt_unique_carrier,branded_code_share,mkt_carrier,mkt_carrier_fl_num,op_unique_carrier,tail_num,op_carrier_fl_num,origin_airport_id,origin,...,distance,carrier_delay,weather_delay,nas_delay,security_delay,late_aircraft_delay,first_dep_time,total_add_gtime,longest_add_gtime,no_name
0,2018-10-26,WN,WN,WN,1849,WN,N7828A,1849,13232,MDW,...,251.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2018-07-16,UA,UA,UA,673,UA,N14219,673,11042,CLE,...,288.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2018-05-18,AA,AA_CODESHARE,AA,5861,YV,N908FJ,5861,11298,DFW,...,227.0,4.0,0.0,0.0,0.0,62.0,NaN,NaN,NaN,NaN
3,2018-12-13,DL,DL_CODESHARE,DL,6202,G7,N374CA,6202,11433,DTW,...,651.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2019-04-07,DL,DL,DL,855,DL,N3771K,855,15304,TPA,...,773.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [122]:
# Missing Values
def missing_values(df):
    missing_values = df.isnull().sum().sort_values(ascending=False)
    missing_values = missing_values[missing_values>0]
    missing_values_percent = ((df.isnull().sum()/df.isnull().count())*100).sort_values(ascending=False)
    missing_values_percent = missing_values_percent[missing_values_percent>0]
    missing_data = pd.concat([missing_values, missing_values_percent], axis=1, keys=['Missing Values', 'Missing Values %'])
    return missing_data

In [123]:
missing_values(flights)

                     Missing Values  Missing Values %
no_name                      200000          100.0000
total_add_gtime              198618           99.3090
first_dep_time               198618           99.3090
longest_add_gtime            198618           99.3090
cancellation_code            196661           98.3305
late_aircraft_delay          161923           80.9615
security_delay               161923           80.9615
nas_delay                    161923           80.9615
weather_delay                161923           80.9615
carrier_delay                161923           80.9615
air_time                       3919            1.9595
arr_delay                      3880            1.9400
actual_elapsed_time            3845            1.9225
taxi_in                        3491            1.7455
wheels_on                      3490            1.7450
arr_time                       3415            1.7075
taxi_out                       3388            1.6940
wheels_off                     3387            1.6935
dep_delay                      3254            1.6270
dep_time                       3198            1.5990
tail_num                        614            0.3070

In [124]:
missing_data_82 = missing_data[missing_data["Missing Values %"]>82]
missing_data_82

                   Missing Values  Missing Values %
no_name                    200000          100.0000
total_add_gtime            198618           99.3090
first_dep_time             198618           99.3090
longest_add_gtime          198618           99.3090
cancellation_code          196661           98.3305

In [125]:
# missing values more than 82%
missing_82 = missing_data_82.index.tolist()

In [126]:
missing_82

['no_name',
 'total_add_gtime',
 'first_dep_time',
 'longest_add_gtime',
 'cancellation_code']

We need to remove columns with more than 80% missing values.
Also, we need to reomove some unnecessary columns as follows:
- mkt_carrier, operating carrier is enough
- op_unique_carrier
- branded_code_share
- mkt_carrier_fl_num
- op_carrier_fl_num
- diverted
- origin_airport_id
- dest_airport_id
- flights

In [127]:
unnecessary_cols = ['mkt_carrier',
                    'op_unique_carrier',
                    'branded_code_share', 
                    'mkt_carrier_fl_num',
                    'op_carrier_fl_num', 
                    'diverted', 
                    'origin_airport_id',
                    'dest_airport_id',
                    'flights']

In [128]:
cols_to_drop = missing_82 + unnecessary_cols

In [129]:
flights = flights.drop(columns=cols_to_drop)

In [130]:
flights.head()

,fl_date,mkt_unique_carrier,tail_num,origin,origin_city_name,dest,dest_city_name,crs_dep_time,dep_time,dep_delay,...,dup,crs_elapsed_time,actual_elapsed_time,air_time,distance,carrier_delay,weather_delay,nas_delay,security_delay,late_aircraft_delay
0,2018-10-26,WN,N7828A,MDW,"Chicago, IL",STL,"St. Louis, MO",1920,1928.0,8.0,...,N,65.0,59.0,44.0,251.0,NaN,NaN,NaN,NaN,NaN
1,2018-07-16,UA,N14219,CLE,"Cleveland, OH",IAD,"Washington, DC",600,559.0,-1.0,...,N,66.0,66.0,48.0,288.0,NaN,NaN,NaN,NaN,NaN
2,2018-05-18,AA,N908FJ,DFW,"Dallas/Fort Worth, TX",FSM,"Fort Smith, AR",2230,2342.0,72.0,...,N,61.0,55.0,38.0,227.0,4.0,0.0,0.0,0.0,62.0
3,2018-12-13,DL,N374CA,DTW,"Detroit, MI",OMA,"Omaha, NE",830,824.0,-6.0,...,N,158.0,110.0,90.0,651.0,NaN,NaN,NaN,NaN,NaN
4,2019-04-07,DL,N3771K,TPA,"Tampa, FL",CVG,"Cincinnati, OH",1151,1148.0,-3.0,...,N,128.0,124.0,106.0,773.0,NaN,NaN,NaN,NaN,NaN

In [131]:
# remove cancelled flights to focus on flights delays

flights = flights[(flights['cancelled'] != 1)]

In [132]:
missing_values(flights)

                     Missing Values  Missing Values %
late_aircraft_delay          158584         80.638256
nas_delay                    158584         80.638256
weather_delay                158584         80.638256
carrier_delay                158584         80.638256
security_delay               158584         80.638256
air_time                        580          0.294924
arr_delay                       541          0.275093
actual_elapsed_time             506          0.257296
wheels_on                       152          0.077290
taxi_in                         152          0.077290
arr_time                         77          0.039154
wheels_off                       75          0.038137
taxi_out                         75          0.038137
dep_delay                        54          0.027458

In [133]:
# we need to fill columns with more than 50% missing values with zeros 
cols_to_fill = ['late_aircraft_delay',
                'nas_delay',
                'weather_delay',
                'carrier_delay',
                'security_delay']
flights.update(flights[cols_to_fill].fillna(0))

In [135]:
# remove nan values
flights.dropna(axis=0, inplace=True)

In [136]:
missing_values(flights)

Empty DataFrame
Columns: [Missing Values, Missing Values %]
Index: []

In [144]:
flights.to_csv("Data/flights_processed.csv", index=False)

In [137]:
fuel = pd.read_csv("Data/fuel_data.csv")

In [138]:
fuel.head()

,month,airline_id,unique_carrier,carrier,carrier_name,carrier_group_new,sdomt_gallons,satl_gallons,spac_gallons,slat_gallons,...,sdomt_cost,satl_cost,spac_cost,slat_cost,sint_cost,ts_cost,tdomt_cost,tint_cost,total_cost,year
0,1,NaN,NaN,0JQ,NaN,1,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,5100.0,0.0,5100.0,2016
1,1,21352.0,0WQ,0WQ,Avjet Corporation,1,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,396216.0,140239.0,536455.0,2016
2,1,21645.0,23Q,23Q,Songbird Airways Inc.,1,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,2016
3,1,21652.0,27Q,27Q,"Jet Aviation Flight Services, Inc.",1,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,2016
4,1,20408.0,5V,5V,Tatonduk Outfitters Limited d/b/a Everts Air A...,1,260848.0,0.0,0.0,0.0,...,522405.0,0.0,0.0,0.0,0.0,522405.0,569497.0,0.0,569497.0,2016

In [139]:
missing_values(fuel)

                Missing Values  Missing Values %
total_gallons                6          0.197694
tdomt_gallons                3          0.098847
slat_gallons                 2          0.065898
satl_gallons                 1          0.032949
spac_gallons                 1          0.032949
sint_gallons                 1          0.032949
ts_gallons                   1          0.032949
carrier_name                 1          0.032949
tint_gallons                 1          0.032949
sdomt_gallons                1          0.032949
satl_cost                    1          0.032949
spac_cost                    1          0.032949
slat_cost                    1          0.032949
sint_cost                    1          0.032949
unique_carrier               1          0.032949
airline_id                   1          0.032949
tint_cost                    1          0.032949

In [143]:
fuel = fuel.dropna()

In [145]:
fuel.to_csv("Data/fuel_processed.csv", index=False)

In [140]:
passengers = pd.read_csv("Data/passengers_data.csv")

In [141]:
passengers.head()

,departures_scheduled,departures_performed,payload,seats,passengers,freight,mail,distance,ramp_to_ramp,air_time,...,dest_country,dest_country_name,aircraft_group,aircraft_type,aircraft_config,year,month,distance_group,class,data_source
0,0.0,1.0,1100.0,6.0,0.0,0.0,0.0,81.0,40.0,36.0,...,US,United States,0,35,3,2019,3,1,L,DU
1,31.0,30.0,456000.0,2280.0,1263.0,0.0,0.0,1648.0,7800.0,6984.0,...,MX,Mexico,6,673,1,2019,3,4,F,IU
2,29.0,29.0,1258600.0,5075.0,4646.0,3161.0,0.0,255.0,1772.0,1300.0,...,US,United States,6,614,1,2019,12,1,F,DU
3,4.0,4.0,246960.0,936.0,922.0,0.0,0.0,813.0,568.0,471.0,...,US,United States,6,623,1,2017,10,2,F,DU
4,0.0,4.0,886160.0,0.0,0.0,559808.0,0.0,3856.0,0.0,0.0,...,DE,Germany,6,627,2,2017,4,8,G,IF

In [142]:
missing_values(passengers)

Empty DataFrame
Columns: [Missing Values, Missing Values %]
Index: []